Model: "sequential_5"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d_15 (Conv1D)          (None, 2500, 64)          448       
                                                                 
 batch_normalization_15 (Bat  (None, 2500, 64)         256       
 chNormalization)                                                
                                                                 
 max_pooling1d_15 (MaxPoolin  (None, 1250, 64)         0         
 g1D)                                                            
                                                                 
 dropout_20 (Dropout)        (None, 1250, 64)          0         
                                                                 
 conv1d_16 (Conv1D)          (None, 1250, 128)         24704     
                                                                 
 batch_normalization_16 (Bat  (None, 1250, 128)        512       
 chNormalization)                                                
                                                                 
 max_pooling1d_16 (MaxPoolin  (None, 625, 128)         0         
 g1D)                                                            
                                                                 
 dropout_21 (Dropout)        (None, 625, 128)          0         
                                                                 
 conv1d_17 (Conv1D)          (None, 625, 256)          98560     
                                                                 
 batch_normalization_17 (Bat  (None, 625, 256)         1024      
 chNormalization)                                                
                                                                 
 max_pooling1d_17 (MaxPoolin  (None, 312, 256)         0         
 g1D)                                                            
                                                                 
 dropout_22 (Dropout)        (None, 312, 256)          0         
                                                                 
 flatten_5 (Flatten)         (None, 79872)             0         
                                                                 
 dense_10 (Dense)            (None, 256)               20447488  
                                                                 
 dropout_23 (Dropout)        (None, 256)               0         
                                                                 
 dense_11 (Dense)            (None, 55)                14135     
                                                                 
=================================================================
Total params: 20,587,127
Trainable params: 20,586,231
Non-trainable params: 896
_________________________________________________________________
Epoch 1/10
1/2 [==============>...............] - ETA: 4s - loss: 6.6469 - accuracy: 0.0000e+002/2 [==============================] - ETA: 0s - loss: 11.8174 - accuracy: 0.1136   2/2 [==============================] - 6s 2s/step - loss: 11.8174 - accuracy: 0.1136 - val_loss: 2.9557 - val_accuracy: 0.2727
Epoch 2/10
1/2 [==============>...............] - ETA: 1s - loss: 6.6797 - accuracy: 0.65622/2 [==============================] - ETA: 0s - loss: 6.3974 - accuracy: 0.63642/2 [==============================] - 3s 666ms/step - loss: 6.3974 - accuracy: 0.6364 - val_loss: 1.5214 - val_accuracy: 0.2727
Epoch 3/10
1/2 [==============>...............] - ETA: 1s - loss: 6.5966 - accuracy: 0.78122/2 [==============================] - ETA: 0s - loss: 5.2604 - accuracy: 0.77272/2 [==============================] - 2s 758ms/step - loss: 5.2604 - accuracy: 0.7727 - val_loss: 3.3030 - val_accuracy: 0.0909
Epoch 4/10
1/2 [==============>...............] - ETA: 1s - loss: 4.2373 - accuracy: 0.78122/2 [==============================] - ETA: 0s - loss: 3.3295 - accuracy: 0.79552/2 [==============================] - 2s 684ms/step - loss: 3.3295 - accuracy: 0.7955 - val_loss: 4.6208 - val_accuracy: 0.1818
Epoch 5/10
1/2 [==============>...............] - ETA: 1s - loss: 5.9773 - accuracy: 0.68752/2 [==============================] - ETA: 0s - loss: 4.7058 - accuracy: 0.70452/2 [==============================] - 2s 734ms/step - loss: 4.7058 - accuracy: 0.7045 - val_loss: 4.5656 - val_accuracy: 0.1818
Epoch 6/10
1/2 [==============>...............] - ETA: 1s - loss: 0.0882 - accuracy: 0.96882/2 [==============================] - ETA: 0s - loss: 0.0833 - accuracy: 0.97732/2 [==============================] - 2s 737ms/step - loss: 0.0833 - accuracy: 0.9773 - val_loss: 6.0180 - val_accuracy: 0.1818
Epoch 7/10
1/2 [==============>...............] - ETA: 1s - loss: 1.1800 - accuracy: 0.87502/2 [==============================] - ETA: 0s - loss: 1.3167 - accuracy: 0.88642/2 [==============================] - 2s 742ms/step - loss: 1.3167 - accuracy: 0.8864 - val_loss: 8.6477 - val_accuracy: 0.0909
Epoch 8/10
1/2 [==============>...............] - ETA: 2s - loss: 1.2120 - accuracy: 0.87502/2 [==============================] - ETA: 0s - loss: 1.6033 - accuracy: 0.88642/2 [==============================] - 3s 1s/step - loss: 1.6033 - accuracy: 0.8864 - val_loss: 12.1145 - val_accuracy: 0.0909
Epoch 9/10
1/2 [==============>...............] - ETA: 1s - loss: 5.3021e-04 - accuracy: 1.00002/2 [==============================] - ETA: 0s - loss: 0.7938 - accuracy: 0.9545    2/2 [==============================] - 2s 756ms/step - loss: 0.7938 - accuracy: 0.9545 - val_loss: 15.5513 - val_accuracy: 0.0000e+00
Epoch 10/10
1/2 [==============>...............] - ETA: 1s - loss: 0.6795 - accuracy: 0.93752/2 [==============================] - ETA: 0s - loss: 0.4942 - accuracy: 0.95452/2 [==============================] - 2s 751ms/step - loss: 0.4942 - accuracy: 0.9545 - val_loss: 19.2616 - val_accuracy: 0.0000e+00
